# SQL Select Statement

This database has 3 tables named cd.bookings, cd.members and cd.facilities. I used this database to learn sql select statement, and here are some of the problems I worked on:

1. This is how i retrieve all the information from cd.facilities table

In [11]:
%%sql 
SELECT * FROM cd.facilities

9 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (2, 'Badminton Court', Decimal('0'), Decimal('15.5'), Decimal('4000'), Decimal('50')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10')),
 (4, 'Massage Room 1', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), Decimal('5000'), Decimal('80')),
 (7, 'Snooker Table', Decimal('0'), Decimal('5'), Decimal('450'), Decimal('15')),
 (8, 'Pool Table', Decimal('0'), Decimal('5'), Decimal('400'), Decimal('15'))]

2. This is how i retrieve a list of only facility names and costs

In [12]:
%%sql 
SELECT name, membercost FROM cd.facilities

9 rows affected.

[('Tennis Court 1', Decimal('5')),
 ('Tennis Court 2', Decimal('5')),
 ('Badminton Court', Decimal('0')),
 ('Table Tennis', Decimal('0')),
 ('Massage Room 1', Decimal('35')),
 ('Massage Room 2', Decimal('35')),
 ('Squash Court', Decimal('3.5')),
 ('Snooker Table', Decimal('0')),
 ('Pool Table', Decimal('0'))]

3. This is how i produce a list of facilities that charge a fee to members

In [13]:
%%sql 
SELECT * FROM cd.facilities WHERE membercost > 0

5 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (4, 'Massage Room 1', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000')),
 (6, 'Squash Court', Decimal('3.5'), Decimal('17.5'), Decimal('5000'), Decimal('80'))]

4. This is how i produce a list of all facilities with the word 'Tennis' in their name

In [14]:
%%sql 
SELECT * FROM cd.facilities WHERE name LIKE '%Tennis%'

3 rows affected.

[(0, 'Tennis Court 1', Decimal('5'), Decimal('25'), Decimal('10000'), Decimal('200')),
 (1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (3, 'Table Tennis', Decimal('0'), Decimal('5'), Decimal('320'), Decimal('10'))]

5. This is how i retrieve the details of facilities with ID 1 and 5

In [15]:
%%sql 
SELECT * FROM cd.facilities WHERE facid IN (1,5)

2 rows affected.

[(1, 'Tennis Court 2', Decimal('5'), Decimal('25'), Decimal('8000'), Decimal('200')),
 (5, 'Massage Room 2', Decimal('35'), Decimal('80'), Decimal('4000'), Decimal('3000'))]

6. This is how i produce a list of members who joined after the start of September 2012

In [16]:
%%sql 
SELECT memid,surname,firstname,joindate FROM cd.members 
WHERE joindate > '01-09-2012'

10 rows affected.

[(24, 'Sarwin', 'Ramnaresh', datetime.datetime(2012, 9, 1, 8, 44, 42)),
 (26, 'Jones', 'Douglas', datetime.datetime(2012, 9, 2, 18, 43, 5)),
 (27, 'Rumney', 'Henrietta', datetime.datetime(2012, 9, 5, 8, 42, 35)),
 (28, 'Farrell', 'David', datetime.datetime(2012, 9, 15, 8, 22, 5)),
 (29, 'Worthington-Smyth', 'Henry', datetime.datetime(2012, 9, 17, 12, 27, 15)),
 (30, 'Purview', 'Millicent', datetime.datetime(2012, 9, 18, 19, 4, 1)),
 (33, 'Tupperware', 'Hyacinth', datetime.datetime(2012, 9, 18, 19, 32, 5)),
 (35, 'Hunt', 'John', datetime.datetime(2012, 9, 19, 11, 32, 45)),
 (36, 'Crumpet', 'Erica', datetime.datetime(2012, 9, 22, 8, 36, 38)),
 (37, 'Smith', 'Darren', datetime.datetime(2012, 9, 26, 18, 8, 45))]

7. This is how i produce an ordered list of the first 10 surnames in the members table

In [19]:
%%sql 
SELECT memid,surname,firstname,joindate FROM cd.members 
WHERE joindate > '01-09-2012'

10 rows affected.

[(24, 'Sarwin', 'Ramnaresh', datetime.datetime(2012, 9, 1, 8, 44, 42)),
 (26, 'Jones', 'Douglas', datetime.datetime(2012, 9, 2, 18, 43, 5)),
 (27, 'Rumney', 'Henrietta', datetime.datetime(2012, 9, 5, 8, 42, 35)),
 (28, 'Farrell', 'David', datetime.datetime(2012, 9, 15, 8, 22, 5)),
 (29, 'Worthington-Smyth', 'Henry', datetime.datetime(2012, 9, 17, 12, 27, 15)),
 (30, 'Purview', 'Millicent', datetime.datetime(2012, 9, 18, 19, 4, 1)),
 (33, 'Tupperware', 'Hyacinth', datetime.datetime(2012, 9, 18, 19, 32, 5)),
 (35, 'Hunt', 'John', datetime.datetime(2012, 9, 19, 11, 32, 45)),
 (36, 'Crumpet', 'Erica', datetime.datetime(2012, 9, 22, 8, 36, 38)),
 (37, 'Smith', 'Darren', datetime.datetime(2012, 9, 26, 18, 8, 45))]

8. This is how i produce an ordered list of the first 10 surnames in the members table

In [20]:
%%sql 
SELECT DISTINCT surname FROM cd.members ORDER BY surname LIMIT 10

10 rows affected.

[('Bader',),
 ('Baker',),
 ('Boothe',),
 ('Butters',),
 ('Coplin',),
 ('Crumpet',),
 ('Dare',),
 ('Farrell',),
 ('Genting',),
 ('GUEST',)]

9. This is how i get the signup date of my last member

In [21]:
%sql SELECT MAX(joindate) AS latest_signup FROM cd.members

1 rows affected.

[(datetime.datetime(2012, 9, 26, 18, 8, 45),)]

10. This is how i produce a list of the total number of slots booked per facility in the month of September 2012

In [22]:
%%sql 
SELECT facid,sum(slots) AS "Total_slots" FROM cd.bookings 
    WHERE starttime BETWEEN '31-08-2012' AND '01-10-2012'
    GROUP BY facid ORDER BY sum(slots)

9 rows affected.

[(5, 130),
 (3, 430),
 (7, 440),
 (8, 485),
 (6, 556),
 (2, 588),
 (0, 609),
 (1, 609),
 (4, 666)]

11. This is how i produce a list of facilities with more than 1000 slots booked

In [23]:
%%sql
SELECT facid,sum(slots) AS "Total_slots" FROM cd.bookings
GROUP BY facid 
HAVING sum(slots) > 1000

5 rows affected.

[(1, 1278), (2, 1209), (4, 1404), (0, 1320), (6, 1104)]

12. This is how i produce a list of the start times for bookings for tennis courts, for the date '2012-09-21'

In [24]:
%%sql
SELECT cd.bookings.facid,cd.facilities.name,cd.bookings.starttime
FROM cd.bookings INNER JOIN cd.facilities
ON cd.bookings.facid = cd.facilities.facid 
WHERE cd.facilities.facid IN (0,1) 
AND cd.bookings.starttime >= '2012-09-21' 
AND cd.bookings.starttime < '2012-09-22' 
ORDER BY cd.bookings.starttime;

12 rows affected.

[(0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 8, 0)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 8, 0)),
 (0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 9, 30)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 10, 0)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 11, 30)),
 (0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 12, 0)),
 (0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 13, 30)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 14, 0)),
 (0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 15, 30)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 16, 0)),
 (0, 'Tennis Court 1', datetime.datetime(2012, 9, 21, 17, 0)),
 (1, 'Tennis Court 2', datetime.datetime(2012, 9, 21, 18, 0))]

13.This is how i produce a list of the start times for bookings by members named 'David Farrell'

In [25]:
%%sql
SELECT cd.members.firstname,cd.members.surname,cd.bookings.starttime
FROM cd.members INNER JOIN cd.bookings
ON cd.members.memid = cd.bookings.memid 
WHERE cd.members.firstname = 'David'
AND cd.members.surname = 'Farrell'
ORDER BY cd.bookings.starttime

34 rows affected.

[('David', 'Farrell', datetime.datetime(2012, 9, 18, 9, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 18, 13, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 18, 17, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 18, 20, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 19, 9, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 19, 12, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 19, 15, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 20, 11, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 20, 14, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 20, 15, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 21, 10, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 21, 14, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 22, 8, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 22, 17, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 23, 8, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 23, 17, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 23, 19, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 24, 8, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 24, 12, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 24, 16, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 25, 15, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 25, 17, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 26, 13, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 26, 17, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 27, 8, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 28, 9, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 28, 11, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 28, 13, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 29, 10, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 29, 13, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 29, 14, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 29, 16, 0)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 29, 17, 30)),
 ('David', 'Farrell', datetime.datetime(2012, 9, 30, 14, 30))]